; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	image0 - mode
	thermograph1 - mode
	GroundStation3 - direction
	GroundStation1 - direction
	Star6 - direction
	GroundStation2 - direction
	Star5 - direction
	GroundStation4 - direction
	Star0 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star6)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument6 thermograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 thermograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 Star5)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 Star6)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon14)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 GroundStation4)
	(supports instrument10 image0)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 Star6)
	(supports instrument11 image0)
	(calibration_target instrument11 GroundStation2)
	(calibration_target instrument11 GroundStation4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star13)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 GroundStation4)
	(calibration_target instrument12 Star5)
	(supports instrument13 image0)
	(supports instrument13 thermograph1)
	(calibration_target instrument13 Star0)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star10)
)
(:goal (and
	(pointing satellite3 GroundStation3)
	(have_image Star7 image0)
	(have_image Phenomenon8 image0)
	(have_image Star9 image0)
	(have_image Star10 image0)
	(have_image Planet11 thermograph1)
	(have_image Star12 thermograph1)
	(have_image Star13 image0)
	(have_image Phenomenon14 image0)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 9
2. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 0 of 9
3. (turn_to satellite2 star12 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star12)
   goals met: 0 of 9
4. (take_image satellite2 star12 instrument4 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 1 of 9
5. (turn_to satellite2 star10 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star10)
   goals met: 1 of 9
6. (take_image satellite2 star10 instrument4 image0)
   added: (have_image star10 image0)
   goals met: 2 of 9
7. (turn_to satellite2 planet11 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 planet11)
   goals met: 2 of 9
8. (take_image satellite2 planet11 instrument4 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 3 of 9
9. (turn_to satellite2 phenomenon8 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon8)
   goals met: 3 of 9
10. (take_image satellite2 phenomenon8 instrument4 image0)
   added: (have_image phenomenon8 image0)
   goals met: 4 of 9
11. (turn_to satellite2 phenomenon14 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon14)
   goals met: 4 of 9
12. (take_image satellite2 phenomenon14 instrument4 image0)
   added: (have_image phenomenon14 image0)
   goals met: 5 of 9
13. (turn_to satellite2 star13 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 star13)
   goals met: 5 of 9
14. (take_image satellite2 star13 instrument4 image0)
   added: (have_image star13 image0)
   goals met: 6 of 9
15. (turn_to satellite2 star7 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star7)
   goals met: 6 of 9
16. (take_image satellite2 star7 instrument4 image0)
   added: (have_image star7 image0)
   goals met: 7 of 9
17. (turn_to satellite2 star9 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star9)
   goals met: 7 of 9
18. (take_image satellite2 star9 instrument4 image0)
   added: (have_image star9 image0)
   goals met: 8 of 9
19. (turn_to satellite3 groundstation3 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 groundstation3)
   goals met: 9 of 9
